import pytest

import pandas as pd


@pytest.fixture()
def test_operations():
    df = pd.DataFrame({'Дата операции': ['31.12.2021  16:44:00', '31.12.2021  16:42:04'],
                           'Дата платежа': ['31.12.2021', '31.12.2021'],
                           'Номер карты': ['*7197', '*7197'],
                           'Статус': ['OK', 'OK'],
                           'Сумма операции': ['-160,89', '-64'],
                           'Валюта операции': ['RUB', 'RUB'],
                           'Сумма платежа': ['-160,89', '-64'],
                           'Валюта платежа': ['RUB', 'RUB'],
                           'Кэшбэк': ['', ''],
                           'Категория': ['Супермаркеты', 'Супермаркеты'],
                           'МСС': ['5411', '5411'],
                           'Описание': ['Колхоз', 'Колхоз'],
                           'Бонусы (включая кэшбэк)': ['3', '1'],
                           'Округление на инвесткопилку': ['0', '0'],
                           'Сумма операции с округлением': ['160,89', '64']
                       })
    return df


@pytest.fixture()
def error_file():
    em_df = pd.DataFrame()
    return em_df


@pytest.fixture()
def empty_df():
    em_df = pd.DataFrame({'Дата операции': [],
              'Дата платежа': [],
              'Номер карты': [],
              'Статус': [],
              'Сумма операции': [],
              'Валюта операции': [],
              'Сумма платежа': [],
              'Валюта платежа': [],
              'Кэшбэк': [],
              'Категория': [],
              'МСС': [],
              'Описание': [],
              'Бонусы (включая кэшбэк)': [],
              'Округление на инвесткопилку': [],
              'Сумма операции с округлением': []
              })
    return em_df
